Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The second configuration, provided by `TenantConfigResolver`, is used when an incoming request is mapped to the `tenant-a` tenant.
ja_jp: `TenantConfigResolver` によって提供される 2 番目の設定は、受信リクエストが `tenant-a` テナントにマップされるときに使用されます。

source: The second example shows the use of lambda scoped transactions, the first just runs a `Runnable` within a transaction, the second, runs `Callable` with some specific options. In particular the `exceptionHandler` method can be used to control if the transaction is rolled back or not on exception, and the `semantic` method controls the behaviour if an existing transaction is already started.
ja_jp: 2つ目の例は、ラムダスコープのトランザクションを使用しています。1つ目は単にトランザクション内で `Runnable` 、2つ目はいくつかの特定のオプションをつけて `Callable` を実行します。特に、 `exceptionHandler` メソッドは、例外発生時にトランザクションをロールバックするかどうかを制御するために使用され、 `semantic` メソッドは、既存のトランザクションが既に開始されている場合の動作を制御します。

source: The second method shows the use of lambda scoped transactions with `QuarkusTransaction.runner(...)`; the first example just runs a `Runnable` within a new transaction, the second does the same but joining the existing transaction (if any), and the third calls a `Callable` with some specific options. In particular the `exceptionHandler` method can be used to control if the transaction is rolled back or not on exception.
ja_jp: 2つ目のメソッドは、 `QuarkusTransaction.runner(...)` を使用したラムダスコープのトランザクションの使用を示しています。最初の例では、新しいトランザクション内で `Runnable` を実行し、2 番目の例では同じことをしますが、既存のトランザクション（もしあれば）に参加し、3 番目の例ではいくつかの特有のオプションを指定して `Callable` を呼び出します。 特に `exceptionHandler` メソッドは、例外が発生したときにトランザクションをロールバックするかどうかを制御するために使用することができます。

source: The second option is to declare an interceptor method directly in the test class; the method is then invoked in the relevant interception phase.
ja_jp: もう 1 つの方法は、テストクラスでインターセプターメソッドを直接宣言することです。この場合、メソッドが関連するインターセプションフェーズで呼び出されます。

source: The second part of the rule unit is the drl file containing the rules belonging to this unit.
ja_jp: ルールユニットの 2 番目の部分は、このユニットに属するルールを含む drl ファイルです。

source: The second point means only methods returning an object or `void` can use `@RunOnVirtualThread`. Methods returning a `Uni` or a `CompletionStage` **cannot** run on virtual threads.
ja_jp: 2つ目のポイントは、オブジェクトまたは `void` を返すメソッドだけが `@RunOnVirtualThread` を使えるということです。 `Uni` や `CompletionStage` を返すメソッドは、仮想スレッドでは実行 *できません* 。

source: The second reactive transaction is used to count the entities.
ja_jp: 2 つ目のリアクティブトランザクションは、エンティティーをカウントするために使用されます。

source: The second rest client invocation happens, and the virtual thread is blocked again (but not the carrier thread).
ja_jp: 2回目のRESTクライアント呼び出しが発生し、仮想スレッドは再びブロックされます（キャリアスレッドはブロックされません）。

source: The second stage is a minimal image copying the produced native executable
ja_jp: 第 2 段階は、生成されたネイティブ実行可能ファイルをコピーする最小限のイメージです

source: The second step is to define a Kubernetes/OpenShift service to point to the Docker image you created and pushed during build. Take a look at link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/k8s/funqy-service.yaml[funqy-service.yaml]
ja_jp: 2つ目のステップは、ビルド中に作成しプッシュしたDockerイメージを指すKubernetes/OpenShiftサービスを定義することです。 link:{quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/k8s/funqy-service.yaml[funqy-service.yaml] を見てみましょう。

source: The second step is to define a Kubernetes/OpenShift service to point to the Docker image you created and pushed during build. Take a look at {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/k8s/funqy-service.yaml[funqy-service.yaml]
ja_jp: 2つ目のステップは、ビルド時に作成してプッシュしたDockerイメージを指すようにKubernetes/OpenShiftサービスを定義することです。 {quickstarts-tree-url}/funqy-quickstarts/funqy-knative-events-quickstart/src/main/k8s/funqy-service.yaml[funqy-service.yaml] を見てください。

source: The second way is to pass `-Dquarkus.native.monitoring=jfr` at build time:
ja_jp: 2 番目の方法では、ビルド時に `-Dquarkus.native.monitoring=jfr` を渡します。

source: The secret key is required for encrypting a randomly generated `PKCE` `code_verifier` while the user is being redirected with the `code_challenge` query parameter to OpenID Connect Provider to authenticate. The `code_verifier` will be decrypted when the user is redirected back to Quarkus and sent to the token endpoint alongside the `code`, client secret and other parameters to complete the code exchange. The provider will fail the code exchange if a `SHA256` digest of the `code_verifier` does not match the `code_challenge` provided during the authentication request.
ja_jp: 秘密鍵は、ユーザーが認証のために OpenID Connect Provider に `code_challenge` クエリーパラメーターでリダイレクトされている間に、ランダムに生成される `PKCE` `code_verifier` を暗号化するために必要となります。Code_verifier` は、ユーザーが Quarkus にリダイレクトされる際に復号化され、 `code` やクライアントシークレットなどのパラメーターと一緒にトークンエンドポイントに送信され、コード交換を完了させることができます。プロバイダーは `code_verifier` の `SHA256` ダイジェストが認証リクエストで指定された `code_challenge` と一致しない場合、コード交換に失敗します。

source: The secret key is required to encrypt a randomly generated PKCE `code_verifier` while the user is redirected to an OIDC provider with the `code_challenge` query parameter to authenticate. The `code_verifier` is decrypted when the user is redirected back to Quarkus and sent to the token endpoint alongside the `code`, client secret, and other parameters to complete the code exchange. The provider will fail the code exchange if a `SHA256` digest of the `code_verifier` does not match the `code_challenge` provided during the authentication request.
ja_jp: 秘密鍵は、ランダムに生成された PKCE `code_verifier` を暗号化するために必要です。ユーザーは `code_challenge` クエリーパラメーターを使用して OIDC プロバイダーにリダイレクトされ、認証されます。 `code_verifier` は、ユーザーが Quarkus にリダイレクトされるときに復号化され、 `code`、クライアントシークレット、およびその他のパラメーターとともにトークンエンドポイントに送信され、コード交換が完了します。 `code_verifier` の `SHA256` ダイジェストが、認証のリクエスト時に提供された `code_challenge` と一致しない場合、プロバイダーはコード交換に失敗します。

source: The secret key is required to encrypt a randomly generated PKCE `code_verifier` while the user is redirected with the `code_challenge` query parameter to an OIDC provider to authenticate. The `code_verifier` is decrypted when the user is redirected back to Quarkus and sent to the token endpoint alongside the `code`, client secret, and other parameters to complete the code exchange. The provider will fail the code exchange if a `SHA256` digest of the `code_verifier` does not match the `code_challenge` that was provided during the authentication request.
ja_jp: シークレットキーは、ランダムに生成された PKCE `code_verifier` を暗号化するために必要です。一方、ユーザーは `code_challenge` クエリーパラメーターを使用して OIDC プロバイダーにリダイレクトされ、認証されます。 `code_verifier` は、ユーザーが Quarkus にリダイレクトされるときに復号化され、 `code`、クライアントシークレット、およびその他のパラメーターとともにトークンエンドポイントに送信され、コード交換が完了します。 `code_verifier` の `SHA256` ダイジェストが、認証のリクエスト時に提供された `code_challenge` と一致しない場合、プロバイダーはコード交換に失敗します。

source: The section tag is also registered under the `set` alias:
ja_jp: セクションタグも `set` のエイリアスで登録されています。

source: The security encryption key can be set with the link:all-config#quarkus-vertx-http_quarkus.http.auth.session.encryption-key[`quarkus.http.auth.session.encryption-key`] configuration option, as described in the link:security-authentication-mechanisms#form-auth[security guide].
ja_jp: セキュリティー暗号鍵は、link:security-authentication-mechanisms#form-auth[セキュリティーガイド] で 説明されているように、link:all-config#quarkus-vertx-http_quarkus.http.auth.session.encryption-key[`quarkus.http.auth.session.encryption-key`] 設定オプションで 設定できます。

source: The sender address must be verified (SPF + DKIM) and the email explicitly added to the verified list
ja_jp: 送信者アドレスの認証（SPF + DKIM）と、認証済みリストへの明示的なメール追加が必要です

source: The separate server mode provides more direct control over Netty-specific settings but requires a dedicated port for gRPC traffic.
ja_jp: 独立サーバーモードは、Netty 固有の設定をより直接的に制御できますが、gRPC トラフィック用に専用ポートが必要です。

source: The sequential security validation process results in one of three outcomes:
ja_jp: 順次行われるセキュリティ検証の結果、3つのうち1つの結果が得られます:

source: The serialize method takes the object without a default constructor and creates a `KeyProxy` that contains the information necessary to recreate the `DSAPublicKey`.
ja_jp: シリアル化メソッドは、デフォルトのコンストラクターなしでオブジェクトを取得し、 `DSAPublicKey` の再作成に必要な情報を含む `KeyProxy` を作成します。

source: The serializer classname used to serialize the payload Type: _string_
ja_jp: レコードの値のシリアライズに使用されるシリアライザのクラス名 Type: _string_

source: The serializer classname used to serialize the record's key Type: _string_
ja_jp: レコードのキーをシリアライズするために使用されるシリアライザのクラス名 Type: _string_

source: The server must use a keystore that contains its certificate and private key
ja_jp: サーバーは証明書と秘密鍵を含むキーストアを使用する必要があります。

source: The server must use a keystore that contains its certificate and private key.
ja_jp: サーバーは、証明書と秘密鍵を含むキーストアを使用する必要があります。

source: The server part of Quarkus REST (`quarkus-rest` and its dependencies) provide an implementation of the Jakarta REST specification, but leverage Quarkus' build time processing and the unified I/O model provided by Vert.x.
ja_jp: Quarkus REST (旧: RESTEasy Reactive) のサーバー部分 ( `quarkus-resteasy-reactive` とその依存関係) は、Jakarta REST仕様の実装を提供しますが、 Quarkusのビルド時処理とVert.xが提供する統一I/Oモデルを活用しています。

source: The server part of RESTEasy Reactive (`quarkus-resteasy-reactive` and its dependencies) provide an implementation of the JAX-RS specification, but leverage Quarkus' build time processing and the unified I/O model provided by Vert.x.
ja_jp: RESTEasy Reactiveのサーバー部分（ `quarkus-resteasy-reactive` とその依存関係）は、JAX-RS仕様の実装を提供しますが、Quarkusのビルド時処理とVert.xが提供する統一I/Oモデルを活用しています。

source: The server part of RESTEasy Reactive (`quarkus-resteasy-reactive` and its dependencies) provide an implementation of the Jakarta REST specification, but leverage Quarkus' build time processing and the unified I/O model provided by Vert.x.
ja_jp: RESTEasy Reactiveのサーバー部分（ `quarkus-resteasy-reactive` とその依存関係）は、Jakarta REST仕様の実装を提供しますが、Quarkusのビルド時処理とVert.xが提供する統一I/Oモデルを活用しています。

source: The server will return the complete schema of the GraphQL API.
ja_jp: サーバーは、GraphQL APIの完全なスキーマを返します。

source: The service URL for the Pulsar service
ja_jp: パルサー・サービスのサービスURL

source: The service implementation bean can also extend the Mutiny implementation base, where the class name is structured as follows: `Mutiny${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase`.
ja_jp: サービス実装Beanは、Mutinyの実装ベースを拡張することもでき、その場合、クラス名は以下のように構成されます。 `Mutiny${NAME_OF_THE_SERVICE}Grpc.${NAME_OF_THE_SERVICE}ImplBase`

source: The service is registered and unregistered automatically.
ja_jp: サービスは自動的に登録および登録解除されます。

source: The service name is derived from the injection point - the field name is used. The `quarkus.grpc.clients.hello.host` property must be set.
ja_jp: サービス名はインジェクションポイントに由来する - フィールド名を使用しています。 `quarkus.grpc.clients.hello.host` プロパティの設定が必要です。

source: The service name that will be registered in the tracing collector, Jaeger in this case.
ja_jp: トレースコレクタに登録されるサービス名で、この場合は Jaeger です。

source: The service name, method and type can be found in the _tags_.
ja_jp: サービス名、メソッド、タイプは _tags_ で確認できます。

source: The service registry URL, given on the admin console, such as `https://bu98.serviceregistry.rhcloud.com/t/0e95af2c-6e11-475e-82ee-f13bd782df24/apis/registry/v2`
ja_jp: 管理コンソールで指定されているサービスレジストリーの URL (例: `https://bu98.serviceregistry.rhcloud.com/t/0e95af2c-6e11-475e-82ee-f13bd782df24/apis/registry/v2`)

source: The service registry URL, given on the admin console, such as `https://bu98.serviceregistry.rhcloud.com/t/0e95af2c-6e11-475e-82ee-f13bd782df24/apis/registry/v3`
ja_jp: 管理コンソールで指定されているサービスレジストリーの URL (例: `https://bu98.serviceregistry.rhcloud.com/t/0e95af2c-6e11-475e-82ee-f13bd782df24/apis/registry/v3`)

source: The service should respond with a `Greeting added!` message.
ja_jp: サービスは、 `Greeting added!` というメッセージで応答するでしょう。

source: The service should respond with the following json content.
ja_jp: このサービスは以下のjsonコンテンツで応答するでしょう。

source: The services are _served_ by a _server_. Available services (_CDI beans_) are automatically registered and exposed.
ja_jp: サービスは _サーバー_ によって _提供されます_ 。利用可能なサービス( _CDIBean_ )は自動的に登録され、公開されます。

source: The servlet context
ja_jp: サーブレットコンテキスト

source: The session age is calculated by adding the lifespan value of the current IDToken and the values of the `quarkus.oidc.authentication.session-age-extension` and `quarkus.oidc.token.lifespan-grace` properties. Of the last two properties only `quarkus.oidc.authentication.session-age-extension` should be used to significantly extend the session lifespan if required since `quarkus.oidc.token.lifespan-grace` is only meant for taking some small clock skews into consideration.
ja_jp: セッション年齢は、現在のIDTokenの寿命値と、 `quarkus.oidc.authentication.session-age-extension` と `quarkus.oidc.token.lifespan-grace` プロパティーの値を加算して計算されます。最後の2つのプロパティーのうち、 `quarkus.oidc.authentication.session-age-extension` だけは、必要に応じてセッションの寿命を大幅に延ばすために使用すべきです。 `quarkus.oidc.token.lifespan-grace` は小さなクロックスキューを考慮することだけを目的としている為です。

source: The session cookie SameSite status
ja_jp: セッション Cookie の SameSite ステータス

source: The session for this demo is valid for a short period of time and, on every page refresh, you will be asked to re-authenticate. For information about how to increase the session timeouts, see the Keycloak https://www.keycloak.org/docs/latest/server_admin/#_timeouts[session timeout] documentation. For example, you can access the Keycloak Admin console directly from the dev UI by clicking the `Keycloak Admin` link if you use xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-keycloak-devservices[Dev Services for Keycloak] in dev mode:
ja_jp: このデモのセッションは短時間有効で、ページ更新のたびに再認証を求められます。セッションタイムアウトを増やす方法については、Keycloak link:https://www.keycloak.org/docs/latest/server_admin/#_timeouts[セッションタイムアウト]の ドキュメントを参照してください。例えば、 xref:security-oidc-code-flow-authentication.adoc#code-flow-integration-testing-keycloak-devservices[Dev Services for Keycloak] をdevモードで使用している場合、 `Keycloak Admin` リンクをクリックすることで、dev UIから直接Keycloak Adminコンソールにアクセスすることができます：

source: The session state that Quarkus OIDC keeps includes the ID, access and refresh tokens. Additionally, if the authorization code grant response returns the access token expiry and scope properties, then their values are also stored.
ja_jp: Quarkus OIDC が保持するセッション状態には、ID、アクセス、およびリフレッシュトークンが含まれます。さらに、認可コード付与のレスポンスでアクセストークンの有効期限とスコーププロパティーが返された場合は、それらの値も保存されます。

source: The set of decorated types includes all bean types which are Java interfaces, except for `java.io.Serializable`.
ja_jp: 装飾された型のセットには、 `java.io.Serializable` を除く、Java インターフェースであるすべての Bean 型が含まれます。

source: The settings page is a dialog that contains settings for Dev UI:
ja_jp: 設定ページは、Dev UI の設定を含むダイアログです。

source: The shared JaCoCo data file will be: `my-extension-project/target/jacoco.exec`.
ja_jp: 共有される JaCoCo データファイルは `my-extension-project/target/jacoco.exec` になります。

source: The shared JaCoCo data will be reused for all tests.
ja_jp: 共有された JaCoCo データはすべてのテストで再利用されます。

source: The signals
ja_jp: シグナル

source: The signature, which verifies the token's integrity.
ja_jp: トークンの整合性を検証する署名。

source: The simplest answer is that you can continue to leverage the widely used and very powerful JAX-RS APIs to expose a REST layer for your application, while gaining a significant improvement in the maximum throughput the application can achieve. The application should also start slightly faster and consume a little less memory.
ja_jp: 最も単純な答えは、アプリケーションの REST レイヤを公開する為に広く使われている非常に強力な JAX-RS API を活用し続けながら、アプリケーションが達成できる最大スループットを大幅に向上できるということです。また、アプリケーションは起動が少し速くなり、メモリーの消費量が少し減るはずです。

source: The simplest approach to mock a client for tests is to use Mockito and `@InjectMock`.
ja_jp: テスト用にクライアントをモックする最も簡単な方法は、Mockito と `@InjectMock` を使用することです。

source: The simplest example is:
ja_jp: 最も簡単な例

source: The simplest is to write it directly in the file, like this:
ja_jp: 一番簡単なのは、このようにファイルに直接書き込むことです。

source: The simplest possible command mode application with access to Quarkus API's might appear as follows:
ja_jp: QuarkusのAPIにアクセスできる最もシンプルなコマンドモードアプリケーションは、次のようになります:

source: The simplest possible command mode application with access to Quarkus APIs might appear as follows:
ja_jp: QuarkusのAPIにアクセスできる最もシンプルなコマンドモードのアプリケーションは、以下のようになります:

source: The simplest way to start this container in the cloud is with the Azure Container Instances service. It simply creates a container on Azure infrastructure.
ja_jp: このコンテナーをクラウド上で起動する最もシンプルな方法は、Azure Container Instancesサービスです。これは、Azureインフラストラクチャ上にコンテナーを作成するだけです。

source: The single-page application returns the same data to the Quarkus user.
ja_jp: シングルページアプリケーションが、Quarkus ユーザーに同じデータを返します。

source: The single-page application uses Authorization Code Flow to authenticate the user and retrieve tokens from the OIDC provider.
ja_jp: シングルページアプリケーションが、認可コードフローを使用してユーザーを認証し、OIDC プロバイダーからトークンを取得します。

source: The single-page application uses the access token to retrieve the service data from the Quarkus service.
ja_jp: シングルページアプリケーションが、アクセストークンを使用して、Quarkus サービスからサービスデータを取得します。

source: The situation where multiple OIDC `web-app` tenants protect the tenant-specific paths is less typical and also requires an extra care. When multiple OIDC `web-app` tenants such as `tenant-a`, `tenant-b` and default tenants are used to control access to the tenant specific paths, the users authenticated with one OIDC provider must not be able to access the paths requiring an authentication with another provider, otherwise the results can be unpredictable, most likely causing unexpected authentication failures. For example, if the `tenant-a` authentication requires a Keycloak authentication and the `tenant-b` authentication requires an Auth0 authentication, then, if the `tenant-a` authenticated user attempts to access a path secured by the `tenant-b` configuration, then the session cookie will not be verified, since the Auth0 public verification keys can not be used to verify the tokens signed by Keycloak. An easy, recommended way to avoid multiple `web-app` tenants conflicting with each other is to set the tenant specific session path as shown in the following example:
ja_jp: 複数の OIDC `web-app` テナントがテナント固有のパスを保護する状況はあまり一般的ではなく、特別な注意も必要です。 `tenant-a`、`tenant-b`、およびデフォルトテナントなどの複数の OIDC `web-app` テナントを使用してテナント固有のパスへのアクセスを制御する場合、1 つの OIDC プロバイダーで認証されたユーザーは、別のプロバイダーによる認証が必要なパスにアクセスできません。アクセスできてしまうと、結果が予測不可能になり、予期しない認証エラーが発生する可能性が高くなります。 たとえば、`tenant-a` 認証に Keycloak 認証が必要で、`tenant-b` 認証に Auth0 認証が必要な場合、`tenant-a` で認証済みユーザーが `tenant-b` 設定で保護されたパスにアクセスしようとすると、Auth0 公開検証キーを使用して Keycloak によって署名されたトークンを検証できないため、セッション Cookie は検証されません。 複数の `web-app` テナントが互いに競合するのを回避するための簡単で推奨される方法は、次の例に示すように、テナント固有のセッションパスを設定することです。

source: The size of each region can be customized via the `quarkus.hibernate-orm.cache."<region_name>".memory.object-count` property (Replace _<region_name>_ with the actual region name).
ja_jp: 各リージョンのサイズは、 `quarkus.hibernate-orm.cache."<region_name>".memory.object-count` プロパティーを介してカスタマイズできます (_<region_name>_ は実際のリージョン名に置き換えます)。

source: The size of every part in a multipart request must conform to the value of `quarkus.http.limits.max-form-attribute-size`, for which the default is 2048 bytes. Any request with a part of a size exceeding this configuration will result in HTTP status code 413.
ja_jp: マルチパートリクエストの各パートのサイズは、 `quarkus.http.limits.max-form-attribute-size` の値に準拠する必要があり、そのデフォルトは 2048 バイトです。この設定を超えるサイズのパートを持つリクエストは、HTTPステータスコード413となります。

source: The size of every part in a multipart request must conform to the value of `quarkus.http.limits.max-form-attribute-size`, for which the default is 2048 bytes. Any request with a part size exceeding this configuration will result in HTTP status code 413.
ja_jp: マルチパートリクエストの各パートのサイズは、 `quarkus.http.limits.max-form-attribute-size` の値に準拠する必要があります。デフォルトは 2048 バイトです。この設定を超えるパーツサイズのリクエストは、HTTP ステータスコード 413 になります。

source: The size of the aligned heap chunks can be changed during native build time. A custom value (in number of bytes) can be passed via the `-H:AlignedHeapChunkSize` flag. One caveat is that this value needs to be multiple of 4096 (4KB).
ja_jp: 整列ヒープチャンクのサイズは、ネイティブビルド時に変更することができます。カスタム値（バイト数）は、 `-H:AlignedHeapChunkSize` フラグで渡すことができます。注意点として、この値は4096（4KB）の倍数である必要があります。

source: The snippet above renders something like:
ja_jp: 上のスニペットは、次のようにレンダリングされます:

source: The snippet above should render something like:
ja_jp: 上記のスニペットは、次のようにレンダリングされるはずです:

source: The snippets in this article are a bit shortened, but basically that’s what the extension contains.
ja_jp: この記事のスニペットは少し短くなっていますが、基本的にはこのエクステンションの内容です。

source: The solution is in the `security-keycloak-authorization-quickstart` link:{quickstarts-tree-url}/security-keycloak-authorization-quickstart[directory].
ja_jp: 解決策は `security-keycloak-authorization-quickstart` link:{quickstarts-tree-url}/security-keycloak-authorization-quickstart[ディレクトリー] にあります。

source: The solution is in the `security-openid-connect-client-quickstart` link:{quickstarts-tree-url}/security-openid-connect-client-quickstart[directory].
ja_jp: 解決策は ` link:{quickstarts-tree-url}/security-openid-connect-client-quickstart[ディレクトリー] にあります。

source: The solution is located in the link:https://github.com/datastax/cassandra-quarkus/tree/main/quickstart[quickstart directory] of the Cassandra Quarkus extension GitHub repository.
ja_jp: ソリューションはCassandra QuarkusエクステンションGitHubレポジトリの link:https://github.com/datastax/cassandra-quarkus/tree/main/quickstart[quickstart directory] にあります。

source: The solution is located in the `amqp-quickstart` link:{quickstarts-tree-url}/amqp-quickstart[directory].
ja_jp: ソリューションは `amqp-quickstart` link:{quickstarts-tree-url}/amqp-quickstart[ディレクトリ] にあります。

source: The solution is located in the `amqp-quickstart` {quickstarts-tree-url}/amqp-quickstart[directory].
ja_jp: ソリューションは、 `amqp-quickstart` {quickstarts-tree-url}/amqp-quickstart[directory] にあります。

source: The solution is located in the `cache-quickstart` link:{quickstarts-tree-url}/cache-quickstart[directory].
ja_jp: ソリューションは `cache-quickstart` link:{quickstarts-tree-url}/cache-quickstart[ディレクトリ] にあります。

source: The solution is located in the `cache-quickstart` {quickstarts-tree-url}/cache-quickstart[directory].
ja_jp: ソリューションは `cache-quickstart` {quickstarts-tree-url}/cache-quickstart[directory] にあります。

source: The solution is located in the `config-quickstart` link:{quickstarts-tree-url}/config-quickstart[directory].
ja_jp: ソリューションは `config-quickstart` link:{quickstarts-tree-url}/config-quickstart[ディレクトリ] にあります。

source: The solution is located in the `config-quickstart` {quickstarts-tree-url}/config-quickstart[directory].
ja_jp: ソリューションは `config-quickstart` {quickstarts-tree-url}/config-quickstart[directory] にあります。

source: The solution is located in the `context-propagation-quickstart` link:{quickstarts-tree-url}/context-propagation-quickstart[directory].
ja_jp: ソリューションは `context-propagation-quickstart` link:{quickstarts-tree-url}/context-propagation-quickstart[ディレクトリ] にあります。

source: The solution is located in the `context-propagation-quickstart` {quickstarts-tree-url}/context-propagation-quickstart[directory].
ja_jp: このソリューションは `context-propagation-quickstart` {quickstarts-tree-url}/context-propagation-quickstart[ディレクトリ]にあります。

source: The solution is located in the `funqy-amazon-lambda-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-http-quickstart[directory].
ja_jp: ソリューションは `funqy-amazon-lambda-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-http-quickstart[ディレクトリ] にあります。

source: The solution is located in the `funqy-amazon-lambda-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart[directory].
ja_jp: ソリューションは `funqy-amazon-lambda-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart[ディレクトリー] にあります。
